AccumulationRegisters/омг_ОстаткиПредоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>омг_ОстаткиПредоплаты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/омг_Предоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_Предоплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СтатусыПредоплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InvoiceId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроверок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TransactionId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйДокументВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистраторЗаписи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийОказанияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОказанияУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКлиенту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_ВидОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_ВидОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНаличный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/омг_СтатусыПредоплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_СтатусыПредоплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПринята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизведенВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасходДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СоглашенияСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СоглашенияСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидДоговораНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.омг_ВидДоговораНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпособовОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЭТАвтономно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОповещатьОбОтсутствииНомераСлипЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочкаСБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграцииСПлатежнымиСистемами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьПодтверждениеОплатыАвтономногоЭТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОрганизацииНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючКассыНСПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайрингНСПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОплатыСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСсылкаСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_АдресТерминала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИнтеграцияОплатаНаТерминал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ИспользуемыйТерминал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ПортТерминала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодключаемоеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омг_РаботаСРеестрамиСервер/Ext/Module.bsl
Процедура Омг_СобратьУслуги(Страховые = Истина) Экспорт
		
	Запрос = Новый Запрос; 
	УсловиеСтраховые = ""; 
	ТекДата = НачалоДня(ТекущаяДата()); 
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РеестрОказанныхУслугПоСоглашениям.Ссылка КАК Ссылка,
	|	РеестрОказанныхУслугПоСоглашениям.НачалоПериода КАК НачалоПериода,
	|	РеестрОказанныхУслугПоСоглашениям.КонецПериода КАК КонецПериода,
	|	РеестрОказанныхУслугПоСоглашениям.Филиал КАК Филиал,
	|	РеестрОказанныхУслугПоСоглашениям.Контрагент КАК Контрагент,
	|	РеестрОказанныхУслугПоСоглашениям.Соглашение КАК Соглашение
	|ИЗ
	|	Документ.РеестрОказанныхУслугПоСоглашениям КАК РеестрОказанныхУслугПоСоглашениям
	|ГДЕ
	|	РеестрОказанныхУслугПоСоглашениям.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеестрОказанныхУслугПоСоглашениям.ПометкаУдаления = ЛОЖЬ
	|	И РеестрОказанныхУслугПоСоглашениям.омг_АвтоСтраховые = &омг_АвтоСтраховые
	|
	|СГРУППИРОВАТЬ ПО
	|	РеестрОказанныхУслугПоСоглашениям.Ссылка, 
	|	РеестрОказанныхУслугПоСоглашениям.НачалоПериода,
	|	РеестрОказанныхУслугПоСоглашениям.КонецПериода,
	|	РеестрОказанныхУслугПоСоглашениям.Филиал,
	|	РеестрОказанныхУслугПоСоглашениям.Контрагент,
	|	РеестрОказанныхУслугПоСоглашениям.Соглашение
	|	УПОРЯДОЧИТЬ ПО
	|	Филиал,
	|	НачалоПериода";  
	
	Если Страховые Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоМесяца(ТекДата)));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецМесяца(ТекДата)));
		
	иначе
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ТекДата));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекДата));
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("омг_АвтоСтраховые", Страховые);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРеестры = РезультатЗапроса.Выбрать();   
	
	Если Страховые Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.омг_СтраховаяПрограмма.Владелец КАК омг_СтраховаяПрограммаВладелец, 
		|	ОказаниеУслуг.Филиал КАК Филиал,
		|	НАЧАЛОПЕРИОДА(ОказаниеУслуг.Дата, МЕСЯЦ) КАК Дата,
		|	ОказаниеУслуг.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Дата >= &НачалоМесяца
		|	И ОказаниеУслуг.омг_СтраховаяПрограмма <> Значение(Справочник.СоглашенияСтрахования.ПустаяСсылка)
		|	И ОказаниеУслуг.Дата <= &КонецМесяца
		|	И ОказаниеУслуг.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслуг.омг_СтраховаяПрограмма,
		|	ОказаниеУслуг.омг_СтраховаяПрограмма.Владелец,
		|	ОказаниеУслуг.Филиал,
		|	НАЧАЛОПЕРИОДА(ОказаниеУслуг.Дата, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Филиал,
		|	омг_СтраховаяПрограммаВладелец,
		|	омг_СтраховаяПрограмма";
		
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекДата));
		Запрос.УстановитьПараметр("КонецМесяца",КонецМесяца(ТекДата));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СслкаДокумент = Неопределено;	
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("НачалоПериода",НачалоДня(ВыборкаДетальныеЗаписи.Дата));
			СтрПоиска.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
			СтрПоиска.Вставить("Соглашение",ВыборкаДетальныеЗаписи.омг_СтраховаяПрограмма);
			ВыборкаРеестры.Сбросить();
			Если ВыборкаРеестры.НайтиСледующий(СтрПоиска) Тогда	
				СслкаДокумент = ВыборкаРеестры.Ссылка
			КонецЕсли;
			
			ЗаполнитьДокумент(ВыборкаДетальныеЗаписи.Филиал,ВыборкаДетальныеЗаписи.Дата,СслкаДокумент,ВыборкаДетальныеЗаписи.омг_СтраховаяПрограмма,ВыборкаДетальныеЗаписи.омг_СтраховаяПрограммаВладелец); 
		КонецЦикла;
		
	иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Филиал
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|
		|СГРУППИРОВАТЬ ПО
		|	Филиалы.Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			
			ПервыйДень = ТекДата;
			Сч = Ложь;	
			Пока НачалоДня(ПервыйДень) <= НачалоДня(ТекДата) Цикл
				СслкаДокумент = Неопределено;	
				СтрПоиска = Новый Структура;
				СтрПоиска.Вставить("НачалоПериода",НачалоДня(ПервыйДень));
				СтрПоиска.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал); 
				ВыборкаРеестры.Сбросить();
				Если ВыборкаРеестры.НайтиСледующий(СтрПоиска) Тогда	
					СслкаДокумент = ВыборкаРеестры.Ссылка
				КонецЕсли;
				
				ЗаполнитьДокумент(ВыборкаДетальныеЗаписи.Филиал,ПервыйДень,СслкаДокумент);  
				ПервыйДень = ПервыйДень + 60*60*24;
			КонецЦикла;
		КонецЦикла;		
	КонецЕсли;
	
	//ТаблицаНовыхДокументов = Новый ТаблицаЗначений;
	//ТаблицаНовыхДокументов.Колонки.Добавить("Ссылка",Новый ОписаниеТипов("ДокументСсылка.РеестрОказанныхУслугПоСоглашениям"));
	//ТаблицаНовыхДокументов.Колонки.Добавить("Филиал",Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	//ТаблицаНовыхДокументов.Колонки.Добавить("НачалоПериода",Новый ОписаниеТипов("Дата"));
	//ТаблицаНовыхДокументов.Колонки.Добавить("КонецПериода",Новый ОписаниеТипов("Дата"));
	//
	//Запрос = Новый Запрос; 
	//УсловиеСтраховые = ""; 
	//ТекДата = ТекущаяДата(); 
	//НачалоПериода = НачалоМесяца(ТекДата);
	//КонецПериода = КонецМесяца(ТекДата);
	//
	//Если не омг_АвтоСтраховые Тогда	
	//	НачалоПериода = НачалоДня(ТекДата);
	//	КонецПериода = КонецДня(ТекДата);
	//КонецЕсли;	
	//
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВЫБОР
	//               |		КОГДА ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
	//               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//               |		ИНАЧЕ ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма.Владелец
	//               |	КОНЕЦ КАК Контрагент,
	//               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма КАК Соглашение,
	//               |	ОказаниеУслугРаботы.Ссылка.Филиал КАК Филиал,
	//               |	&НачалоПериода КАК НачалоПериода,
	//               |	&КонецПериода КАК КонецПериода
	//               |ИЗ
	//               |	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	//               |ГДЕ
	//               |	ОказаниеУслугРаботы.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//               |	И ОказаниеУслугРаботы.Ссылка.Проведен
	//               |	И ВЫБОР
	//               |			КОГДА &омг_АвтоСтраховые
	//               |				ТОГДА ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма <> ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
	//               |			ИНАЧЕ ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
	//               |		КОНЕЦ
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ВЫБОР
	//               |		КОГДА ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
	//               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//               |		ИНАЧЕ ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма.Владелец
	//               |	КОНЕЦ,
	//               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма,
	//               |	ОказаниеУслугРаботы.Ссылка.Филиал
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	РеестрОказанныхУслугПоСоглашениям.Ссылка КАК Ссылка,
	//               |	РеестрОказанныхУслугПоСоглашениям.Филиал КАК Филиал,
	//               |	РеестрОказанныхУслугПоСоглашениям.Контрагент КАК Контрагент,
	//               |	РеестрОказанныхУслугПоСоглашениям.Соглашение КАК Соглашение
	//               |ИЗ
	//               |	Документ.РеестрОказанныхУслугПоСоглашениям КАК РеестрОказанныхУслугПоСоглашениям
	//               |ГДЕ
	//               |	РеестрОказанныхУслугПоСоглашениям.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//               |	И РеестрОказанныхУслугПоСоглашениям.омг_Авто = ИСТИНА
	//               |	И РеестрОказанныхУслугПоСоглашениям.омг_АвтоСтраховые = &омг_АвтоСтраховые
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РеестрОказанныхУслугПоСоглашениям.Ссылка,
	//               |	РеестрОказанныхУслугПоСоглашениям.Филиал,
	//               |	РеестрОказанныхУслугПоСоглашениям.Контрагент,
	//               |	РеестрОказанныхУслугПоСоглашениям.Соглашение";  
	//
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	//Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	//Запрос.УстановитьПараметр("омг_АвтоСтраховые", омг_АвтоСтраховые);
	//
	//
	//РезультатЗапроса = Запрос.ВыполнитьПакет();
	//
	//ВыборкаУслуги = РезультатЗапроса[0].Выбрать();
	//ВыборкаРеестры = РезультатЗапроса[1].Выбрать();  
	//Пока ВыборкаРеестры.Следующий() Цикл
	//	ДокументОбъект = ВыборкаРеестры.Ссылка.ПолучитьОбъект();
	//	ДокументОбъект.Услуги.Очистить();  
	//	ДокументОбъект.омг_УслугиВозврат.Очистить();
	//	Попытка	
	//		ДокументОбъект.Записать();
	//	Исключение
	//		Сообщить("Не удалось записать документ " + ДокументОбъект.Ссылка);
	//		Продолжить;
	//	КонецПопытки;	
	//	
	//КонецЦикла;
	//
	//ДокументОбъект = Неопределено;
	//Филиал         = Неопределено;
	//Контрагент     = Неопределено;
	//Соглашение     = Неопределено;
	//Пока ВыборкаУслуги.Следующий() Цикл 
	//	ВыборкаРеестры.Сбросить();
	//	Если ДокументОбъект = Неопределено или
	//		не Филиал         = ВыборкаУслуги.Филиал или
	//		не Контрагент     = ВыборкаУслуги.Контрагент или
	//		не Соглашение     = ВыборкаУслуги.Соглашение	
	//		Тогда  
	//		СтрПоиска = Новый Структура;
	//		СтрПоиска.Вставить("Филиал",ВыборкаУслуги.Филиал);
	//		СтрПоиска.Вставить("Контрагент",ВыборкаУслуги.Контрагент);
	//		СтрПоиска.Вставить("Соглашение",ВыборкаУслуги.Соглашение);
	//		Если ВыборкаРеестры.НайтиСледующий(СтрПоиска) Тогда
	//			ДокументОбъект = ВыборкаРеестры.Ссылка.ПолучитьОбъект()
	//		иначе
	//			ДокументОбъект = Документы.РеестрОказанныхУслугПоСоглашениям.СоздатьДокумент(); 
	//			ЗаполнитьЗначенияСвойств(ДокументОбъект,ВыборкаУслуги);
	//			ДокументОбъект.Дата = КонецПериода -1;	
	//			ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь; 
	//			ДокументОбъект.Комментарий = "Создано автоматически " + ТекДата;  
	//			ДокументОбъект.омг_Авто = Истина;
	//			ДокументОбъект.омг_АвтоСтраховые = омг_АвтоСтраховые;
	//			//ДокументОбъект.Записать();	
	//		КонецЕсли;	
	//		
	//		Филиал         = ВыборкаУслуги.Филиал;
	//		Контрагент     = ВыборкаУслуги.Контрагент;
	//		Соглашение     = ВыборкаУслуги.Соглашение;  
	//		
	//		СтрВозврата = омг_РаботаСРеестрамиСервер.омг_ВернутьУслугиНаСервере(омг_АвтоСтраховые,Истина,Филиал,НачалоПериода,КонецПериода,Контрагент,Соглашение);
	//		ДокументОбъект.Услуги.Очистить();
	//		ДокументОбъект.омг_УслугиВозврат.Очистить();
	//		
	//		ДокументОбъект.Услуги.Загрузить(СтрВозврата.Услуги);
	//		ДокументОбъект.омг_УслугиВозврат.Загрузить(СтрВозврата.омг_УслугиВозврат);
	//					
	//		Попытка
	//			ДокументОбъект.ПометкаУдаления = Ложь;
	//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//		Исключение
	//			Сообщить("Не удалось записать документ " + ДокументОбъект.Ссылка);
	//			Продолжить;
	//		КонецПопытки;
	//	КонецЕсли;	
	//КонецЦикла; 
	//
КонецПроцедуры

Функция омг_ВернутьУслугиНаСервере(ВключатьСтраховые = Ложь, ЭтоЗакрытиеСмены = Ложь, Филиал = Неопределено,НачалоПериода,КонецПериода,Контрагент = Неопределено, Соглашение = Неопределено) Экспорт
	
	ДокументОбьектРеестр = Документы.РеестрОказанныхУслугПоСоглашениям.СоздатьДокумент(); 
	
	Услуги = ДокументОбьектРеестр.Услуги.Выгрузить(); 
	Услуги.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	
	омг_УслугиВозврат = ДокументОбьектРеестр.омг_УслугиВозврат.Выгрузить();
	омг_УслугиВозврат.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	
	омг_Оплаты = ДокументОбьектРеестр.омг_Оплаты.Выгрузить();
	омг_Оплаты.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы")); 
	
	ДокументОбьектРеестр = Неопределено;
	
	Запрос = Новый Запрос; 
	Условия = "";  
	УсловияПредоплаты = ""; 
	УсловияВозврата = "";
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		
		Условия = Условия + 
		"
		|	И ОказаниеУслугРаботы.Ссылка.Филиал = &Филиал";	
		
		УсловияПредоплаты = УсловияПредоплаты + 
		"
		|	И омг_ОстаткиПредоплатыОбороты.ДокументПоступления.Филиал = &Филиал";
		
		Запрос.УстановитьПараметр("Филиал", Филиал);  
		
		УсловияВозврата = УсловияВозврата + 
		" И омг_Предоплаты.Заявка.Филиал = &Филиал";
		
		Запрос.УстановитьПараметр("Филиал", Филиал); 
	
	КонецЕсли;
	
	Если ВключатьСтраховые Тогда
		Условия = Условия + 
		"
		|	И не ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)";
		
	иначе
		
		Условия = Условия + 
		"
		|	И ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)";	
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Условия = Условия + 
		"
		|	И ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма.Владелец = &Контрагент";	
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Соглашение) Тогда
		
		Условия = Условия + 
		"
		| И ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = &Соглашение";	
		Запрос.УстановитьПараметр("Соглашение", Соглашение);		
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Ссылка.Клиент КАК Клиент,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |			ТОГДА ОказаниеУслугРаботы.Ссылка.Сотрудник
	               |		ИНАЧЕ ОказаниеУслугРаботы.Сотрудник
	               |	КОНЕЦ КАК Сотрудник,
	               |	ОказаниеУслугРаботы.Ссылка.Дата КАК Дата,
	               |	ОказаниеУслугРаботы.Номенклатура КАК Номенклатура,
	               |	СУММА(ОказаниеУслугРаботы.Количество) КАК Количество,
	               |	СУММА(ОказаниеУслугРаботы.Сумма) КАК Сумма,
	               |	СУММА(ОказаниеУслугРаботы.Омг_СуммаНДС) КАК Омг_СуммаНДС,
	               |	ОказаниеУслугРаботы.Ссылка.ОМГ_СтавкаНДС КАК омг_СтавкаНДС,
	               |	ОказаниеУслугРаботы.Ссылка КАК ДокументПродажи,
	               |	ОказаниеУслугРаботы.Ссылка.омг_ИспользуемыйТерминал КАК омг_ИспользуемыйТерминал,
	               |	ОказаниеУслугРаботы.Ссылка.ПолученоНаличными - ОказаниеУслугРаботы.Ссылка.Сдача КАК ПолученоНаличными,
	               |	ОказаниеУслугРаботы.Ссылка.Касса КАК Касса,
	               |	ОказаниеУслугРаботы.Ссылка.Филиал КАК Филиал,
	               |	ОказаниеУслугРаботы.Ссылка.СуммаДокумента - ОказаниеУслугРаботы.Ссылка.ПолученоНаличными + ОказаниеУслугРаботы.Ссылка.Сдача КАК ПолученоБезНаличными,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
	               |				И НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.Дата, ДЕНЬ)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоВозврат,
	               |	ОказаниеУслугРаботы.Ссылка.ДокументОснование КАК ДокументОснование,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ОказаниеУслугРаботы.Ссылка.ДокументОснование) = ТИП(Документ.ОказаниеУслуг)
	               |			ТОГДА ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата
	               |		ИНАЧЕ &ПустаяДата
	               |	КОНЕЦ КАК ДатаОснованияВозврата,
	               |	ОказаниеУслугРаботы.Ссылка.СуммаДокумента КАК СуммаДокумента,
	               |	СУММА(ОказаниеУслугРаботы.СуммаСкидки) КАК СуммаСкидки,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
	               |				И НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.Дата, ДЕНЬ)
	               |			ТОГДА -1
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ЭтоТекущийВозврат
	               |ПОМЕСТИТЬ ВТ_УслугиЗаПериод
	               |ИЗ
	               |	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |ГДЕ
	               |	ОказаниеУслугРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОказаниеУслугРаботы.Ссылка.Проведен"
					+Условия+ "
		           |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |			ТОГДА ОказаниеУслугРаботы.Ссылка.Сотрудник
	               |		ИНАЧЕ ОказаниеУслугРаботы.Сотрудник
	               |	КОНЕЦ,
	               |	ОказаниеУслугРаботы.Ссылка,
	               |	ОказаниеУслугРаботы.Номенклатура,
	               |	ОказаниеУслугРаботы.Ссылка.СуммаДокумента,
	               |	ОказаниеУслугРаботы.Ссылка.СуммаДокумента - ОказаниеУслугРаботы.Ссылка.ПолученоНаличными + ОказаниеУслугРаботы.Ссылка.Сдача,
	               |	ОказаниеУслугРаботы.Ссылка.ПолученоНаличными - ОказаниеУслугРаботы.Ссылка.Сдача,
	               |	ОказаниеУслугРаботы.Ссылка.Клиент,
	               |	ОказаниеУслугРаботы.Ссылка.Дата,
	               |	ОказаниеУслугРаботы.Ссылка.ОМГ_СтавкаНДС,
	               |	ОказаниеУслугРаботы.Ссылка.Филиал,
	               |	ОказаниеУслугРаботы.Ссылка.омг_ИспользуемыйТерминал,
	               |	ОказаниеУслугРаботы.Ссылка.Касса,
	               |	ОказаниеУслугРаботы.Ссылка.ДокументОснование,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ОказаниеУслугРаботы.Ссылка.ДокументОснование) = ТИП(Документ.ОказаниеУслуг)
	               |			ТОГДА ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата
	               |		ИНАЧЕ &ПустаяДата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
	               |				И НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата, ДЕНЬ) < НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.Дата, ДЕНЬ)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
	               |				И НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.ДокументОснование.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ОказаниеУслугРаботы.Ссылка.Дата, ДЕНЬ)
	               |			ТОГДА -1
	               |		ИНАЧЕ 1
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_УслугиЗаПериод.Клиент КАК Клиент,
	               |	ВТ_УслугиЗаПериод.Сотрудник КАК Сотрудник,
	               |	ВТ_УслугиЗаПериод.Дата КАК Дата,
	               |	ВТ_УслугиЗаПериод.Филиал КАК Филиал,
	               |	ВТ_УслугиЗаПериод.Номенклатура КАК Номенклатура,
	               |	СУММА(ВТ_УслугиЗаПериод.Количество) КАК Количество,
	               |	СУММА(ВТ_УслугиЗаПериод.Сумма) КАК Сумма,
	               |	ВТ_УслугиЗаПериод.омг_СтавкаНДС КАК омг_СтавкаНДС,
	               |	СУММА(ВТ_УслугиЗаПериод.Омг_СуммаНДС) КАК Омг_СуммаНДС,
	               |	ВТ_УслугиЗаПериод.ДокументПродажи КАК ДокументПродажи,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ВТ_УслугиЗаПериод.омг_ИспользуемыйТерминал
	               |	КОНЕЦ КАК омг_ЭквайринговыйТерминал,
	               |	ВТ_УслугиЗаПериод.ПолученоНаличными КАК омг_СуммаНаличный,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |				И ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ВТ_УслугиЗаПериод.Касса
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |						И ВТ_УслугиЗаПериод.ПолученоБезНаличными <= 0
	               |					ТОГДА ВТ_УслугиЗаПериод.Касса
	               |			КОНЕЦ
	               |	КОНЕЦ КАК омг_Касса,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоБезНаличными < 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВТ_УслугиЗаПериод.ПолученоБезНаличными
	               |	КОНЕЦ КАК омг_СуммаБезналичный,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |				И ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.Смешанный)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |						И ВТ_УслугиЗаПериод.ПолученоБезНаличными <= 0
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.Наличный)
	               |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.БезНаличный)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК омг_ВидОплаты,
	               |	ВТ_УслугиЗаПериод.ЭтоВозврат КАК ЭтоВозврат,
	               |	ВТ_УслугиЗаПериод.ДокументОснование КАК ДокументОснование,
	               |	ЕСТЬNULL(ВТ_УслугиЗаПериод.ДатаОснованияВозврата, &ПустаяДата) КАК ДатаДокументаОснования,
	               |	ВТ_УслугиЗаПериод.СуммаДокумента КАК СуммаДокумента,
	               |	СУММА(ВТ_УслугиЗаПериод.СуммаСкидки) КАК омг_СуммаСкидки,
	               |	ВТ_УслугиЗаПериод.ЭтоТекущийВозврат КАК ЭтоТекущийВозврат
	               |ИЗ
	               |	ВТ_УслугиЗаПериод КАК ВТ_УслугиЗаПериод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_УслугиЗаПериод.Клиент,
	               |	ВТ_УслугиЗаПериод.Номенклатура,
	               |	ВТ_УслугиЗаПериод.ДокументОснование,
	               |	ВТ_УслугиЗаПериод.Дата,
	               |	ВТ_УслугиЗаПериод.омг_СтавкаНДС,
	               |	ВТ_УслугиЗаПериод.Филиал,
	               |	ВТ_УслугиЗаПериод.Сотрудник,
	               |	ЕСТЬNULL(ВТ_УслугиЗаПериод.ДатаОснованияВозврата, &ПустаяДата),
	               |	ВТ_УслугиЗаПериод.ДокументПродажи,
	               |	ВТ_УслугиЗаПериод.ЭтоВозврат,
	               |	ВТ_УслугиЗаПериод.ЭтоТекущийВозврат,
	               |	ВТ_УслугиЗаПериод.ПолученоНаличными,
	               |	ВТ_УслугиЗаПериод.СуммаДокумента,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоБезНаличными < 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ВТ_УслугиЗаПериод.ПолученоБезНаличными
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |				И ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.Смешанный)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |						И ВТ_УслугиЗаПериод.ПолученоБезНаличными <= 0
	               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.Наличный)
	               |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.БезНаличный)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |				И ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ВТ_УслугиЗаПериод.Касса
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_УслугиЗаПериод.ПолученоНаличными > 0
	               |						И ВТ_УслугиЗаПериод.ПолученоБезНаличными <= 0
	               |					ТОГДА ВТ_УслугиЗаПериод.Касса
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_УслугиЗаПериод.ПолученоБезНаличными > 0
	               |			ТОГДА ВТ_УслугиЗаПериод.омг_ИспользуемыйТерминал
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументПродажи,
	               |	Сумма
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.КлючСтроки КАК КлючСтроки,
	               |	ОказаниеУслугРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |ГДЕ
	               |	ОказаниеУслугРаботы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОказаниеУслугРаботы.Ссылка.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КлючСтроки УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугОплата.Ссылка КАК Ссылка,
	               |	ОказаниеУслугОплата.ЭквайринговыйТерминал.омг_ИспользуемыйТерминал КАК омг_ЭквайринговыйТерминал
	               |ИЗ
	               |	Документ.ОказаниеУслуг.Оплата КАК ОказаниеУслугОплата
	               |ГДЕ
	               |	ОказаниеУслугОплата.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОказаниеУслугОплата.Ссылка.Проведен
	               |	И НЕ ОказаниеУслугОплата.ЭквайринговыйТерминал = ЗНАЧЕНИЕ(Справочник.ЭквайринговыеТерминалы.ПустаяССылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка,
	               |	ОказаниеУслугОплата.НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ОстаткиПредоплатыОбороты.Клиент КАК Клиент,
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления КАК ДокументОплаты,
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления.омг_ИспользуемыйТерминал КАК омг_ЭквайринговыйТерминал,
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления.Касса КАК омг_Касса,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(омг_ОстаткиПредоплатыОбороты.ДокументПоступления) = ТИП(Документ.ПриходныйКассовыйОрдер)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.Наличный)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.омг_ВидОплаты.БезНаличный)
	               |	КОНЕЦ КАК омг_ВидОплаты,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ омг_ОстаткиПредоплатыОбороты.СуммаПриход = 0
	               |				ТОГДА омг_ОстаткиПредоплатыОбороты.СуммаПриход
	               |		КОНЕЦ) КАК омг_Сумма,   
				   |	СУММА(ВЫБОР
	               |				КОГДА НЕ омг_ОстаткиПредоплатыОбороты.СуммаРасход = 0
	               |						ТОГДА омг_ОстаткиПредоплатыОбороты.СуммаРасход
	               |		КОНЕЦ) КАК СуммаЗачет,
	               |	омг_ОстаткиПредоплатыОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.омг_ОстаткиПредоплаты.Обороты(, , Регистратор, ) КАК омг_ОстаткиПредоплатыОбороты
	               |ГДЕ
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"
					+ УсловияПредоплаты + 
				   "
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления,
	               |	омг_ОстаткиПредоплатыОбороты.Регистратор,
	               |	омг_ОстаткиПредоплатыОбороты.Клиент,
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления.омг_ИспользуемыйТерминал,
	               |	омг_ОстаткиПредоплатыОбороты.ДокументПоступления.Касса
	               |
	               |УПОРЯДОЧИТЬ ПО   
				   |	Клиент, 
				   |	ДокументОплаты,
	               |	омг_ОстаткиПредоплатыОбороты.Регистратор.Дата 
				   |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_Предоплаты.Заявка.Клиент КАК Клиент,
	               |	омг_Предоплаты.ПлатежныйДокумент.Ссылка КАК ДокументОплаты,
	               |	омг_Предоплаты.ПлатежныйДокумент.омг_ИспользуемыйТерминал КАК омг_ЭквайринговыйТерминал,
	               |	омг_Предоплаты.ПлатежныйДокумент.Касса КАК омг_Касса,
	               |	омг_Предоплаты.Сумма КАК омг_Сумма, 
				    |	омг_Предоплаты.ВозвратУслуг КАК ВозвратУслуг,
	               |	омг_Предоплаты.РегистраторЗаписи КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.омг_Предоплаты КАК омг_Предоплаты
	               |ГДЕ
	               |	омг_Предоплаты.ПлатежныйДокументВозврата.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И омг_Предоплаты.Статус = ЗНАЧЕНИЕ(Перечисление.омг_СтатусыПредоплаты.ПроизведенВозврат)" 
				   + УсловияВозврата +
	               " 
				   |
				   | 	УПОРЯДОЧИТЬ ПО
	               |	Клиент,
	               |	омг_Предоплаты.РегистраторЗаписи.Дата";

							
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ПустаяДата",Дата("00010101"));
	РезультатЗапросаПакетов = Запрос.ВыполнитьПакет(); 
	ВыборкаПоСтрокам = РезультатЗапросаПакетов[1].Выбрать();   
	РезультатЗапросаПоДокументам = РезультатЗапросаПакетов[2].Выбрать();
	РезультатЗапросаПоОплатам = РезультатЗапросаПакетов[3].Выбрать(); 
	РезультатЗапросаПоПредоплатам = РезультатЗапросаПакетов[4].Выгрузить();
	РезультатЗапросаПоВозвратуПредоплатам = РезультатЗапросаПакетов[5].Выгрузить();
	ОказаниеУслуг = Документы.ОказаниеУслуг.ПустаяСсылка();  
	СуммаДокументаНал = 0;
	СуммаДокументаБезНал = 0;
	КолСтрокДок = 0;   
	СуммаДокументаНалОстаток = 0;  
	СуммаДокументаБезНалОстаток = 0; 
	СтрокаТаблицы = Неопределено; 
	ПромежуточныйПоследняяСтрокаНал  = 0; 
	ПромежуточныйПоследняяСтрокаБезНал = 0;
	Пока ВыборкаПоСтрокам.Следующий() Цикл
		СуммаСтрокиНал = 0;
		СуммаСтрокиБезНал = 0;
		Если ОказаниеУслуг <> ВыборкаПоСтрокам.ДокументПродажи Тогда  
			Если не СтрокаТаблицы = Неопределено и не ПромежуточныйПоследняяСтрокаНал  = 0 и  не ПромежуточныйПоследняяСтрокаБезНал = 0 Тогда
				СтрокаТаблицы.омг_СуммаНаличный = ПромежуточныйПоследняяСтрокаНал; 
				СтрокаТаблицы.омг_СуммаБезналичный = ПромежуточныйПоследняяСтрокаБезНал; 
				Если  СтрокаТаблицы.омг_СуммаБезналичный = 0  Тогда	
					СтрПоиска = Новый Структура;
					СтрПоиска.Вставить("Ссылка",СтрокаТаблицы.ДокументПродажи);
					РезультатЗапросаПоОплатам.НайтиСледующий(стрПоиска);
					СтрокаТаблицы.омг_ЭквайринговыйТерминал = РезультатЗапросаПоОплатам.омг_ЭквайринговыйТерминал;
					РезультатЗапросаПоОплатам.Сбросить(); 
					
				КонецЕсли;
				
			КонецЕсли; 
			Коэф = ВыборкаПоСтрокам.ЭтоТекущийВозврат;
			ОказаниеУслуг =  ВыборкаПоСтрокам.ДокументПродажи;
			СуммаДокументаНал    = ВыборкаПоСтрокам.омг_СуммаНаличный* Коэф;
			СуммаДокументаБезНал = ВыборкаПоСтрокам.омг_СуммаБезналичный* Коэф;
			СуммаДокументаНалОстаток = СуммаДокументаНал;
			СуммаДокументаБезНалОстаток = СуммаДокументаБезНал;
			ИтогПоДокументуНал = 0;
			ИтогПоДокументуБезНал = 0;
			ЭтоПоследняяСтрока = Ложь;
			стрПоиска = Новый Структура;
			стрПоиска.Вставить("Ссылка",ВыборкаПоСтрокам.ДокументПродажи);
			РезультатЗапросаПоДокументам.НайтиСледующий(стрПоиска);
			КолСтрокДокЗнаменатель = РезультатЗапросаПоДокументам.КлючСтроки;
			КолСтрокДок = РезультатЗапросаПоДокументам.КлючСтроки;
			РезультатЗапросаПоДокументам.Сбросить();
			Если ВыборкаПоСтрокам.СуммаДокумента = 0 Тогда
				СуммаДокумента = ВыборкаПоСтрокам.ДокументПродажи.Работы.Итог("Сумма")	
			иначе
				СуммаДокумента = ВыборкаПоСтрокам.СуммаДокумента;	
			КонецЕсли;  
			Если не ВыборкаПоСтрокам.ЭтоВозврат Тогда   // нов
				
				СтрОплаты = омг_Оплаты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрОплаты,ВыборкаПоСтрокам); 
				СтрОплаты.омг_СуммаБезналичный = СтрОплаты.омг_СуммаБезналичный * Коэф;
				СтрОплаты.омг_СуммаНаличный = СтрОплаты.омг_СуммаНаличный * Коэф;
				СтрОплаты.омг_СуммаСкидки = СтрОплаты.омг_СуммаСкидки * Коэф;
				Если не СтрОплаты.омг_СуммаБезналичный = 0 Тогда
					
					СтрПоиска = Новый Структура;
					СтрПоиска.Вставить("Ссылка",СтрОплаты.ДокументПродажи);
					РезультатЗапросаПоОплатам.НайтиСледующий(стрПоиска);
					СтрОплаты.омг_ЭквайринговыйТерминал = РезультатЗапросаПоОплатам.омг_ЭквайринговыйТерминал;
					РезультатЗапросаПоОплатам.Сбросить(); 
					
				КонецЕсли;
				
			КонецЕсли;	                             // нов
		КонецЕсли;	
		
		Если КолСтрокДок > 1 Тогда
			КолСтрокДок = КолСтрокДок - 1;
			Если СуммаДокументаНал <> 0 Тогда 
				Если ВыборкаПоСтрокам.Сумма = 0 Тогда   
					СуммаСтрокиНал = 0;	
				Иначе	
					СуммаСтрокиНал = СуммаДокументаНал / (СуммаДокумента/ВыборкаПоСтрокам.Сумма);
				КонецЕсли;
				//СуммаДокументаНалОстаток = СуммаДокументаНалОстаток - СуммаСтрокиНал;
			КонецЕсли; 
			Если СуммаДокументаБезНал <> 0 Тогда
				Если ВыборкаПоСтрокам.Сумма = 0 Тогда   
					СуммаСтрокиБезНал = 0;	
				Иначе	
					СуммаСтрокиБезНал = СуммаДокументаБезНал / (СуммаДокумента/ВыборкаПоСтрокам.Сумма);
				КонецЕсли;
				//СуммаДокументаБезНалОстаток = СуммаДокументаБезНалОстаток - СуммаСтрокиБезНал;
			КонецЕсли;  
			ЭтоПоследняяСтрока = Ложь;
		иначе
			Если СуммаДокументаНал <> 0 Тогда
				СуммаСтрокиНал = СуммаДокументаНалОстаток;
			КонецЕсли; 
			Если СуммаДокументаБезНал <> 0 Тогда
				СуммаСтрокиБезНал = СуммаДокументаБезНалОстаток;
			КонецЕсли;
			ЭтоПоследняяСтрока = Истина;
		КонецЕсли;
		ЭтоУслуга = Ложь;
		//Если ВыборкаПоСтрокам.ЭтоВозврат и ЗначениеЗаполнено(ВыборкаПоСтрокам.ДатаДокументаОснования) и КонецДня(ВыборкаПоСтрокам.ДатаДокументаОснования) < НачалоДня(ВыборкаПоСтрокам.Дата)  Тогда				
		Если ВыборкаПоСтрокам.ЭтоВозврат  Тогда
			СтрокаТаблицы = омг_УслугиВозврат.Добавить();	
		иначе
			СтрокаТаблицы = Услуги.Добавить();
			ЭтоУслуга = Истина; 
		КонецЕсли;   
		Коэф = ВыборкаПоСтрокам.ЭтоТекущийВозврат; 
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаПоСтрокам);
		Если ЭтоУслуга Тогда  // нов
			СтрокаТаблицы.омг_ЭтоТекущийВозврат = ?(Коэф<0,Истина,Ложь);
		КонецЕсли;	          // нов
		СтрокаТаблицы.омг_СуммаБезналичный = СуммаСтрокиБезНал ;
		СтрокаТаблицы.омг_СуммаНаличный = СуммаСтрокиНал;  
		Если не СтрокаТаблицы.омг_СуммаБезналичный = 0 и не СтрокаТаблицы.омг_СуммаНаличный = 0 Тогда
			СтрокаТаблицы.омг_СуммаБезналичный = Окр(СтрокаТаблицы.омг_СуммаБезналичный);
			СтрокаТаблицы.омг_СуммаНаличный = Окр(СтрокаТаблицы.омг_СуммаНаличный);
		КонецЕсли;   
		
		СуммаДокументаНалОстаток = СуммаДокументаНалОстаток - СтрокаТаблицы.омг_СуммаНаличный;
		СуммаДокументаБезНалОстаток = СуммаДокументаБезНалОстаток - СтрокаТаблицы.омг_СуммаБезналичный;
		
		ИтогПоДокументуНал = ИтогПоДокументуНал + СтрокаТаблицы.омг_СуммаНаличный;
		ИтогПоДокументуБезНал = ИтогПоДокументуБезНал + СтрокаТаблицы.омг_СуммаБезналичный;
		
		ПромежуточныйПоследняяСтрокаНал = 0; 
		ПромежуточныйПоследняяСтрокаБезНал = 0;
		
		//Если ЭтоПоследняяСтрока Тогда // в последней строке проверяем результаты округления
		ИтогПоДокументуНалМодуль = ?(ИтогПоДокументуНал <0,ИтогПоДокументуНал*-1,ИтогПоДокументуНал);
		СуммаДокументаНалМодуль  = ?(СуммаДокументаНал <0,СуммаДокументаНал*-1,СуммаДокументаНал);
		ИтогПоДокументуБезНалМодуль = ?(ИтогПоДокументуБезНал <0,ИтогПоДокументуБезНал*-1,ИтогПоДокументуБезНал);
		СуммаДокументаБезНалМодуль = ?(СуммаДокументаБезНал <0,СуммаДокументаБезНал*-1,СуммаДокументаБезНал);
		
		Если не ИтогПоДокументуНалМодуль = СуммаДокументаНалМодуль или не ИтогПоДокументуБезНалМодуль = СуммаДокументаБезНалМодуль Тогда
			
			РазНал = ИтогПоДокументуНалМодуль - СуммаДокументаНалМодуль;
			
			РазБезНал = ИтогПоДокументуБезНалМодуль - СуммаДокументаБезНалМодуль; 
			
			РазНал = ?(СтрокаТаблицы.омг_СуммаНаличный<0,РазНал*-1,РазНал);
			РазБезНал = ?(СтрокаТаблицы.омг_СуммаБезналичный<0,РазБезНал*-1,РазБезНал);
			
			ПромежуточныйПоследняяСтрокаНал = СтрокаТаблицы.омг_СуммаНаличный - РазНал;
			ПромежуточныйПоследняяСтрокаБезНал = СтрокаТаблицы.омг_СуммаБезналичный - РазБезНал;
		КонецЕсли;	
		//КонецЕсли; 
		Если ЭтоУслуга и СтрокаТаблицы.омг_СуммаСкидки <> 0 Тогда
			СтрокаТаблицы.Сумма = (СтрокаТаблицы.Сумма + СтрокаТаблицы.омг_СуммаСкидки)
		КонецЕсли;  
		СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма * Коэф; 
		СтрокаТаблицы.Количество = СтрокаТаблицы.Количество * Коэф; 
		СтрокаТаблицы.омг_СуммаСкидки = СтрокаТаблицы.омг_СуммаСкидки * Коэф;  
		//Если не СтрокаТаблицы.омг_СуммаБезналичный = 0 и не ЗначениеЗаполнено(СтрокаТаблицы.омг_ЭквайринговыйТерминал) Тогда
		Если не СтрокаТаблицы.омг_СуммаБезналичный = 0 Тогда
			
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Ссылка",СтрокаТаблицы.ДокументПродажи);
			РезультатЗапросаПоОплатам.НайтиСледующий(стрПоиска);
			СтрокаТаблицы.омг_ЭквайринговыйТерминал = РезультатЗапросаПоОплатам.омг_ЭквайринговыйТерминал;
			РезультатЗапросаПоОплатам.Сбросить(); 
			
		КонецЕсли;
	КонецЦикла;	
	Если не СтрокаТаблицы = Неопределено и не ПромежуточныйПоследняяСтрокаНал  = 0 и  не ПромежуточныйПоследняяСтрокаБезНал = 0 Тогда
		СтрокаТаблицы.омг_СуммаНаличный = ПромежуточныйПоследняяСтрокаНал; 
		СтрокаТаблицы.омг_СуммаБезналичный = ПромежуточныйПоследняяСтрокаБезНал; 
		Если  СтрокаТаблицы.омг_СуммаБезналичный = 0  Тогда	
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Ссылка",СтрокаТаблицы.ДокументПродажи);
			РезультатЗапросаПоОплатам.НайтиСледующий(стрПоиска);
			СтрокаТаблицы.омг_ЭквайринговыйТерминал = РезультатЗапросаПоОплатам.омг_ЭквайринговыйТерминал;
			РезультатЗапросаПоОплатам.Сбросить(); 
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтрВозврата = Новый Структура;
	СтрВозврата.Вставить("Услуги",Услуги);
	СтрВозврата.Вставить("омг_УслугиВозврат",омг_УслугиВозврат);  
	омг_Оплаты.Свернуть("омг_ВидОплаты,омг_ЭквайринговыйТерминал,омг_Касса,ДокументПродажи","омг_СуммаБезналичный,омг_СуммаНаличный,омг_СуммаСкидки");
	СтрВозврата.Вставить("омг_Оплаты",омг_Оплаты);
	СтрВозврата.Вставить("омг_Предоплаты",РезультатЗапросаПоПредоплатам); 
	СтрВозврата.Вставить("РезультатЗапросаПоВозвратуПредоплатам",РезультатЗапросаПоВозвратуПредоплатам);
	
	
	
	Возврат СтрВозврата;
	
КонецФункции

Процедура омг_СоздатьРеестры() Экспорт
	Омг_СобратьУслуги(Ложь)
КонецПроцедуры

Процедура ОбменСБКЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	УзелОбмена = ПланыОбмена.омг_ОбменУМЦБухгалтерияПредприятия30.НайтиПоКоду("ОМ"); // узел услуг 

	Если ЗначениеЗаполнено(УзелОбмена.ДатаНачалаВыгрузкиДокументов) и Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(ТипЗнч(Источник))) Тогда
		 Если УзелОбмена.ДатаНачалаВыгрузкиДокументов > Источник.Дата Тогда
		      Отказ = Истина;
			  Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если типЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		Если Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк  или  Источник.ВидОперации = Перечисления.ВидыОперацийРКО.ПеремещениеВКассу  Тогда  
			//ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,Источник);
			ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("омг_ОбменУМЦБухгалтерияПредприятия30", Источник, Отказ, РежимЗаписи, РежимПроведения);
		КонецЕсли;
	КонецЕсли;
	
	Если типЗнч(Источник) = Тип("ДокументОбъект.РеестрОказанныхУслугПоСоглашениям") Тогда
		
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("омг_ОбменУМЦБухгалтерияПредприятия30", Источник, Отказ, РежимЗаписи, РежимПроведения);	
		
		Для каждого стрНоменклатура из  Источник.Услуги Цикл
			
			НоменклатураОбъект = стрНоменклатура.Номенклатура.ПолучитьОбъект();
			
			//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("омг_ОбменУМЦБухгалтерияПредприятия30",НоменклатураОбъект, Отказ, Истина);
			
			
			Если Источник.ПометкаУдаления Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена,НоменклатураОбъект);
			Иначе	
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,НоменклатураОбъект);
			КонецЕсли;	
			
		КонецЦикла;	    
		
		Для каждого стрНоменклатура из  Источник.омг_УслугиВозврат Цикл  
			
			НоменклатураОбъект = стрНоменклатура.Номенклатура.ПолучитьОбъект();	
			
			//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("омг_ОбменУМЦБухгалтерияПредприятия30", НоменклатураОбъект, Отказ, Истина);
			
			Если Источник.ПометкаУдаления Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена,НоменклатураОбъект);
			Иначе	
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,НоменклатураОбъект);
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьДублиСтрокТаблицыЗначений(Таблица, Колонки = "") Экспорт

		КолонкиЗапроса = "ТЗ." + СтрЗаменить(Колонки, ",", ",ТЗ.");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	" + КолонкиЗапроса + "
					   |ПОМЕСТИТЬ ВТ_ТЗ
					   |ИЗ
					   |	&ТЗ КАК ТЗ
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	" + СтрЗаменить(КолонкиЗапроса, "ТЗ.", "ВТ_ТЗ.") + "
					   |ИЗ
					   |	ВТ_ТЗ КАК ВТ_ТЗ
					   |";

		Запрос.УстановитьПараметр("ТЗ", Таблица);
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТаблицаРезультат = Таблица.СкопироватьКолонки();
		Для каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		
			СтруктураОтбора = Новый Структура(Колонки);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЗ);
			
			РезультатОтбора = Таблица.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаОтбора Из РезультатОтбора Цикл
				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтбора);
				Прервать;
				
			КонецЦикла;
		
		КонецЦикла;
		
	
	Возврат ТаблицаРезультат;

КонецФункции

Процедура ЗаполнитьДокумент(Филиал,ДатаНачалаДокумента,СслкаДокумент = Неопределено,омг_СтраховаяПрограмма= Неопределено,Контрагент= Неопределено) 
	
	Если СслкаДокумент = Неопределено Тогда
		
		ДокументОбъект = Документы.РеестрОказанныхУслугПоСоглашениям.СоздатьДокумент(); 
		ДокументОбъект.Дата = КонецДня(ДатаНачалаДокумента) - 1;
		ДокументОбъект.НачалоПериода = НачалоДня(ДатаНачалаДокумента); 
		Если омг_СтраховаяПрограмма = Неопределено Тогда
			ДокументОбъект.КонецПериода =  НачалоДня(ДатаНачалаДокумента);
		Иначе
			ДокументОбъект.КонецПериода =  КонецМесяца(ДатаНачалаДокумента);
			ДокументОбъект.омг_АвтоСтраховые = Истина;
			ДокументОбъект.Соглашение = омг_СтраховаяПрограмма;	
			ДокументОбъект.Контрагент = Контрагент;
		КонецЕсли;
		ДокументОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Комментарий = "Создано автоматически " +ТекущаяДата()+" обработкой!";	
		ДокументОбъект.Комментарий = Комментарий; 
		ДокументОбъект.Филиал = Филиал;  	
	иначе     
		
		ДокументОбъект = СслкаДокумент.ПолучитьОбъект();
		
	КонецЕсли;    
	
	СтрВозврата = омг_ВернутьУслугиНаСервере(не омг_СтраховаяПрограмма= Неопределено,Ложь,Филиал,ДокументОбъект.НачалоПериода,КонецДня(ДокументОбъект.КонецПериода),Контрагент,омг_СтраховаяПрограмма);
	ДокументОбъект.Услуги.Очистить();
	ДокументОбъект.омг_УслугиВозврат.Очистить(); 
	ДокументОбъект.омг_Оплаты.Очистить();
	
	ДокументОбъект.Услуги.Загрузить(СтрВозврата.Услуги);
	ДокументОбъект.омг_УслугиВозврат.Загрузить(СтрВозврата.омг_УслугиВозврат); 
	ДокументОбъект.омг_Оплаты.Загрузить(СтрВозврата.омг_Оплаты);
	
	Если ДокументОбъект.Услуги.Количество() > 0 или ДокументОбъект.омг_УслугиВозврат.Количество() > 0 
		или ДокументОбъект.омг_Оплаты.Количество() > 0 или ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда 
		ДокументОбъект.ПометкаУдаления = Ложь;
		Если омг_СтраховаяПрограмма = Неопределено Тогда
			ДокументОбъект.Проведен = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);	
		Иначе
			ДокументОбъект.Записать(); 
		КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры
